/*ΥΛΙΚΑ ΓΙΑ ΤΗΝ ΚΙΝΗΣΗ ΤΟΥ ΒΡΑΧΟΥ ΚΑΙ ΚΩΔΙΚΑΣ
1) Arduino or Genuino Board
2) 10k ohm potentiometer
3) stepper motor
4) U2004 Darlington Array
Έχουμε προσθέσει και σχεδιάγραμμα fritzing. Πιθανόν να θέλει και εξωτερική μπαταρία για να μην 
καεί η πλακέτα.
ΣΟΣ: ΧΡΕΙΑΖΕΤΑΙ ΕΞΩΤΕΡΙΚΗ ΒΙΒΛΙΟΘΗΚΗ (Stepper Speed Control)

Stepper Motor Control - speed control

Με τη χρήση ενός απλού ποτεσιόμετρου ελέγχουμε την ταχύτητα του κινητήρα
Αυτό θα βοηθήσει στο να κάνουμε τα δικά μας πειράματα με διαφορετικές ταχύτητες, όσες φορές θέλουμε!

Οδηγίες: Το μοτοράκι είναι στα pins από 8 εώς 11, το ποτενσιόμετρο είναι στο analog input 0.
Όταν το βάζουμε σε πολύ χαμηλή ταχύτητα κλοτσάει.
 */

#include <Stepper.h>

const int stepsPerRevolution = 200;  // μπορούμε να αλλάξουμε τα βήματα σε κάθε ολοκληρωμένη στροφή του κινητήρα


//εδώ δηλώνουμε πού θα βάλουμε το μοτεράκι μας
Stepper myStepper(stepsPerRevolution, 8, 9, 10, 11);

int stepCount = 0;  // μετράμε πόσα βήματα έχει κάνει

void setup() {


 
}

void loop() {
  // διαβάζουμε το ποτεσνιόμετρο
  int sensorReading = analogRead(A0);
  // κάνουμε χαρτογράφηση γιατί μπορεί να δώσει τιμές που δεν τις υποστηρίζει το μοτεράκι, από 0 ως 100.
  //Αν θέλετε άλλες τιμές, μπορείτε να τις αλλάξετε.
  int motorSpeed = map(sensorReading, 0, 1023, 0, 100);
  // αν είναι μηδές δηλώνουμε την ταχύτητα του μοτέρ
  if (motorSpeed > 0) {
    //δεν γυρνάει με το setSpeed το μοτέρ, απλά του λέμε πόσο θέλουμε να γυρίσει.
    myStepper.setSpeed(motorSpeed);
    // γυρνάμε το μοτέρ 1/100 στροφές.
    myStepper.step(stepsPerRevolution / 100);
  }
}
